Джира/src/Catalogs/Центр_Колонки/Центр_Колонки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Центр_Колонки</name>
  <attributes>
    <name>НастройкиКолонки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доски</name>
    <attributes>
      <name>Доска</name>
      <type>
        <types>CatalogRef.Центр_Доски</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Джира/src/InformationRegisters/Центр_НастройкиПользователейКанБан/Центр_НастройкиПользователейКанБан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_НастройкиПользователейКанБан</name>
  <resources>
    <name>НастройкиКолонки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Колонка</name>
    <type>
      <types>CatalogRef.Центр_Колонки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/Catalogs/Центр_Колонки/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПриОткрытииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Центр_НастройкиПользователейКанБан.НастройкиКолонки,
	|	Центр_НастройкиПользователейКанБан.Колонка,
	|	Центр_НастройкиПользователейКанБан.Пользователь
	|ИЗ
	|	РегистрСведений.Центр_НастройкиПользователейКанБан КАК Центр_НастройкиПользователейКанБан
	|ГДЕ
	|	Центр_НастройкиПользователейКанБан.Пользователь = Значение(Справочник.Пользователи.ПустаяСсылка)
	|	И Центр_НастройкиПользователейКанБан.Колонка = &Колонка";

	Запрос.УстановитьПараметр("Колонка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка= РезультатЗапроса.Выбрать();
	//Колонка.КомпоновщикНастроек.Инициализировать(Неопределено);
	//Колонка.КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);

	Если Выборка.Следующий() Тогда
		Колонка.КомпоновщикНастроек.ЗагрузитьНастройки(Выборка.НастройкиКолонки.Получить());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не Объект.Доски.Количество() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Доски не введены");
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Набор = РегистрыСведений.Центр_НастройкиПользователейКанБан.СоздатьНаборЗаписей();
	Набор.Отбор.Колонка.Установить(ТекущийОбъект.Ссылка);
	Набор.Отбор.Пользователь.Установить(ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"));
	Набор.Прочитать();
	Если Набор.Количество() Тогда
		Запись = Набор[0];
		Запись.НастройкиКолонки = Новый ХранилищеЗначения(Колонка.КомпоновщикНастроек.ПолучитьНастройки());
	Иначе
		Запись = Набор.Добавить();
		Запись.Пользователь = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		Запись.Колонка = ТекущийОбъект.Ссылка;
		Запись.НастройкиКолонки = Новый ХранилищеЗначения(Колонка.КомпоновщикНастроек.ПолучитьНастройки());
	КонецЕсли;
	Набор.Записать();
КонецПроцедуры
#КонецОбласти
